close all
clear all
clc

Fs=3072; %Честота на дискретизация
K=1024; %Брой на точки
Rp=0.5; %Максимално затихване в лента на пропускане
Wp=[600 760]/(Fs/2);%Гранична честота
Rs=30; %Минимално затихване в лента на задържане
Ws=[300 880]/(Fs/2);%Честота на затихване
[N,Wn]=cheb1ord(Wp,Ws,Rp,Rs); %Изчисляване реда и граничната честота
[Nz,Dz]=cheby1(N,Rp,Wn); % Изчисляваме полинома
[H,w]=freqz(Nz,Dz,K/2); % Изчисляваме системната функция
m=abs(H); %Изчисляваме АЧХ в линейни единици
ma=-20*log10(m); %Изчисляваме затихването в dB



printsys(Nz,Dz,'z')% Разпечатваме ПФ

figure(1); 
plot(w*Fs/(2*pi),ma); %Изчертаваме затихването
axis([100 1400 0 70])
hold;
grid;

h(:,1)=plot(w*Fs/(2*pi),ma);hold on;
h(:,2)=plot([0 300],[20 20], 'g');hold on;
plot([300 300],[20 0], 'g');hold on;
plot([600 600],[2 0.5], 'g');hold on;
plot([600 760],[0.5 0.5], 'g');hold on;
plot([760 760],[0.5 2], 'g');hold on;
plot([880 880],[0 17], 'g');hold on;
plot([880 1120],[17 17], 'g');hold on;
plot([1120 1120],[17 30], 'g');hold on;
plot([1120 1280],[30 30], 'g');hold on;
plot([1280 1280],[30 25], 'g');hold on;
plot([1280 1400],[25 25], 'g');hold on;

h(:,3)=plot([0 300],[20 20], 'r--');hold on;
plot([300 300],[20 0], 'r--');hold on;
plot([600 600],[2 0.5], 'r--');hold on;
plot([600 760],[0.5 0.5], 'r--');hold on;
plot([760 760],[0.5 2], 'r--');hold on;
plot([880 880],[0 17], 'r--');hold on;
plot([880 1120],[17 17], 'r--');hold on;
plot([1120 1120],[17 30], 'r--');hold on;
plot([1120 1280],[30 30], 'r--');hold on;
plot([1280 1280],[30 25], 'r--');hold on;
plot([1280 1400],[25 25], 'r--');hold on;

xlabel('Честота в HZ');
ylabel('Затихване в dB');
title('Затихване на получения цифров ЛФ и зададения габарит ');
set(h(:,1), 'Color','b')
set(h(:,2), 'Color','r')
set(h(:,3), 'Color','g')
legend(h(1,:), {'Апроксимация по Чебишев', 'Зададен габарит', 'Утежнен габарит'} );



fil=unwrap(angle(H)); % Изчисляване на ФЧХ в rad
figure(2);
plot(w*Fs/(2*pi),fil*180/pi); % Изчертаване на ФЧХ в градуси
xlabel('Честота в HZ');
ylabel('ФЧХ в градуси');
title('Фазово-честотна характеристика');
grid;

z=roots(Nz) % Изчислява корените на числителя
p=roots(Dz) % Изчислява корените на знаменателя
figure(3); 
zplane(Nz,Dz);  % Изчертава ПНД
title('Полюсно-нулева диаграма');

n=(0:199)/Fs;
x1=sin(2*pi*700*n);%Сигнал който се пропуска
x2=sin(2*pi*270*n);%Сигнал който се задържа
[kH,kw]=freqz(Nz,Dz,K/2);
y1=filter(Nz,Dz,x1);%Изчисляване изходния сигнал y1
y2=filter(Nz,Dz,x2);%Изчисляване изходния сигнал y2

figure(4);
subplot(211); %Изчертава на входен сигнал х1 във ВО
plot(n,x1);
grid;
title('Входен сигнал x1=sin(2*pi*700*n)');
xlabel('Отчети на времето n');
ylabel('Амплитуда,V');
subplot(212);plot(n,y1); %Изчертава на входен сигнал y1 във ВО
grid;
xlabel('Отчети на времето n');
ylabel('Амплитуда,V');
title('Изходен сигнал y1');

figure(5);
subplot(211); %Изчертава на входен сигнал х2 във ВО
plot(n,x2);
grid;
title('Входен сигнал x2=sin(2*pi*270*n)');
xlabel('Отчети на времето n');
ylabel('Амплитуда,V');
subplot(212);plot(n,y2); %Изчертава на входен сигнал y2 във ВО
grid;
xlabel('Отчети на времето n');
ylabel('Амплитуда,V');
title('Изходен сигнал y2');

Px1=fft(x1,K);% Изчисляваме Рх1 в ЧО
px1=abs(Px1(1:(K/2)));%изчисляваме спектъра на входен сигнал х1
Px2=fft(x2,K);% Изчисляваме Рх2 в ЧО
px2=abs(Px2(1:(K/2)));%изчисляваме спектъра на входен сигнал х2

Py1=fft(y1,K);% Изчисляваме Ру1 в ЧО
py1=abs(Py1(1:(K/2)));%изчисляваме спектъра на изходен сигнал у1
Py2=fft(y2,K);% Изчисляваме Ру1 в ЧО
py2=abs(Py2(1:(K/2)));%изчисляваме спектъра на изходен сигнал у2

figure(6);
subplot(211);
plot(kw*Fs/(2*pi),px1);
grid;
xlabel('Честота в Hz');
title('Спектър на входен сигнал x1=sin(2*pi*700*n)');
subplot(212);
plot(kw*Fs/(2*pi),py1);
grid;
title('Спектър на изходен сигнал у1');
xlabel('Честота в Hz');

figure(7);
subplot(211);
plot(kw*Fs/(2*pi),px2);
grid;
xlabel('Честота в Hz');
title('Спектър на входен сигнал x2=sin(2*pi*270*n)');
subplot(212);
plot(kw*Fs/(2*pi),py2);
grid;
title('Спектър на изходен сигнал у2');
xlabel('Честота в Hz');

[b0,B,A]=dir2cas(Nz,Dz)%Каскадна реализация

[K,C]=dir2ladr(Nz,Dz); %Мостово-верижна реализация
K
C